hackathon/src/InformationRegisters/МетрикиSLA/МетрикиSLA.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МетрикиSLA</name>
  <resources>
    <name>Реакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Решение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовторнаяРеакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриоритетОбращения</name>
    <type>
      <types>EnumRef.ПриоритетыОбращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/InformationRegisters/МетрикиSLA/ManagerModule.bsl
Функция ПолучитьЗначениеМетрикSLA(ПриоритетОбращения, ТипОбращения) Экспорт 
	
	СтруктураМетрик = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетрикиSLA.Реакция КАК Реакция,
		|	МетрикиSLA.Решение КАК Решение,
		|	МетрикиSLA.ПовторнаяРеакция КАК ПовторнаяРеакция
		|ИЗ
		|	РегистрСведений.МетрикиSLA КАК МетрикиSLA
		|ГДЕ
		|	МетрикиSLA.ТипОбращения = &ТипОбращения
		|	И МетрикиSLA.ПриоритетОбращения = &ПриоритетОбращения";
	
	Запрос.УстановитьПараметр("ПриоритетОбращения", ПриоритетОбращения);
	Запрос.УстановитьПараметр("ТипОбращения", ТипОбращения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Новый Структура("Реакция, Решение, ПовторнаяРеакция", Число(ВыборкаДетальныеЗаписи.Реакция), Число(ВыборкаДетальныеЗаписи.Решение), Число(ВыборкаДетальныеЗаписи.ПовторнаяРеакция));
	КонецЦикла;
	Возврат Новый Структура("Реакция, Решение, ПовторнаяРеакция", 0, 0, 0);
		
КонецФункции
